Revit 2027 API
ConnectorElement.GetLinkedConnectorElement Method
 Get the linked connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorElement GetLinkedConnectorElement()
Public Function GetLinkedConnectorElement As ConnectorElement
public:
ConnectorElement^ GetLinkedConnectorElement()
member GetLinkedConnectorElement : unit -> ConnectorElement
Return Value
ConnectorElement
 The linked connector element. If null, the connector has no link.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace